//
//  hiraganaToKatakana.swift
//  SQliDic
//
//  Created by Archylex on 23/01/2018.
//  Copyright © 2018 Archylex. All rights reserved.
//

import Foundation

func hiraganaToKatakana(sentence: String) -> String {    
    var strok = sentence
    let hira_1 = ["か":"カ","き":"キ","く":"ク","こ":"コ","け":"ケ","さ":"サ","し":"シ","す":"ス","せ":"セ","そ":"ソ","た":"タ","ち":"チ","つ":"ツ","て":"テ","と":"ト","な":"ナ","に":"ニ","ぬ":"ヌ","ね":"ネ","の":"ノ","は":"ハ","ひ":"ヒ","ふ":"フ","へ":"ヘ","ほ":"ホ","ま":"マ","み":"ミ","む":"ム","め":"メ","も":"モ","や":"ヤ","ゆ":"ユ","よ":"ヨ","ら":"ラ","り":"リ","る":"ル","れ":"レ","ろ":"ロ","わ":"ワ","ゐ":"ヰ","ゑ":"ヱ","を":"ヲ","ん":"ン","が":"ガ","ぎ":"ギ","ぐ":"グ","げ":"ゲ","ご":"ゴ","ざ":"ザ","じ":"ジ","ず":"ズ","ぜ":"ゼ","ぞ":"ゾ","だ":"ダ","ぢ":"ヂ","づ":"ヅ","で":"デ","ど":"ド","ば":"バ","び":"ビ","ぶ":"ブ","べ":"ベ","ぼ":"ボ","ぱ":"パ","ぴ":"ピ","ぷ":"プ","ぺ":"ペ","ぽ":"ポ","っ":"ッ"]
    let hira_2 = ["きゃ":"キャ","きゅ":"キュ","きょ":"キョ","しゃ":"シャ","しゅ":"シュ","しょ":"ショ","ちゃ":"チャ","ちゅ":"チュ","ちょ":"チョ","にゃ":"ニャ","にゅ":"ニュ","にょ":"ニョ","ひゃ":"ヒャ","ひゅ":"ヒュ","ひょ":"ヒョ","みゃ":"ミャ","みゅ":"ミュ","みょ":"ミョ","りゃ":"リャ","りゅ":"リュ","りょ":"リョ","ぎゃ":"ギャ","ぎゅ":"ギュ","ぎょ":"ギョ","じゃ":"ジャ","じゅ":"ジュ","じょ":"ジョ","ぢゃ":"ヂャ","ぢゅ":"ヂュ","ぢょ":"ヂョ","びゃ":"ビャ","びゅ":"ビュ","びょ":"ビョ","ぴゃ":"ピャ","ぴゅ":"ピュ","ぴょ":"ピョ"]
    
    for (key, value) in hira_2 {
        strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
    }
    
    for (key, value) in hira_1 {
        strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
    }
    
    return strok
}