//
//  toHiragana.swift
//  SQliDic
//
//  Created by Archylex on 23/01/2018.
//  Copyright © 2018 Archylex. All rights reserved.
//

import Foundation

func toHiragana(sentence: String, language: String) -> String {    
    var strok = sentence
    let kiriji_1 = ["а":"あ","и":"い","й":"い","у":"う","э":"え","е":"え","о":"お","я":"や","ю":"ゆ","ё":"よ","н":"ん","-":"","'":"","б":"っ","в":"っ","г":"っ","д":"っ","ж":"っ","з":"っ","к":"っ","м":"っ","п":"っ","р":"っ","с":"っ","т":"っ","ф":"っ","х":"っ","ц":"っ","ч":"っ","ш":"っ","щ":"っ",":":"ー"]
    let kiriji_2 = ["ка":"か","ки":"き","ку":"く","кэ":"け","ке":"け","ко":"こ","кя":"きゃ","кю":"きゅ","кё":"きょ","са":"さ","си":"し","ши":"し","щи":"し","су":"す","сэ":"せ","се":"せ","со":"そ","ся":"しゃ","ша":"しゃ","ща":"しゃ","сю":"しゅ","шу":"しゅ","щу":"しゅ","сё":"しょ","шо":"しょ","що":"しょ","та":"た","ти":"ち","чи":"ち","цу":"つ","ту":"つ","тэ":"て","те":"て","то":"と","тя":"ちゃ","ча":"ちゃ","тю":"ちゅ","чу":"ちゅ","тё":"ちょ","чо":"ちょ","на":"な","ни":"に","ну":"ぬ","нэ":"ね","не":"ね","но":"の","ня":"にゃ","ню":"にゅ","нё":"にょ","ха":"は","хи":"ひ","фу":"ふ","ху":"ふ","хэ":"へ","хе":"へ","хо":"ほ","хя":"ひゃ","хю":"ひゅ","хё":"ひょ","ма":"ま","ми":"み","му":"む","мэ":"め","ме":"め","мо":"も","мя":"みゃ","мю":"みゅ","мё":"みょ","ра":"ら","ри":"り","ру":"る","рэ":"れ","ре":"れ","ро":"ろ","ря":"りゃ","рю":"りゅ","рё":"りょ","га":"が","ги":"ぎ","гу":"ぐ","гэ":"げ","ге":"げ","го":"ご","гя":"ぎゃ","гю":"ぎゅ","гё":"ぎょ","за":"ざ","зи":"じ","зу":"ず","зэ":"ぜ","зе":"ぜ","зо":"ぞ","зя":"じゃ","жа":"じゃ","зю":"じゅ","жу":"じゅ","зё":"じょ","жо":"じょ","да":"だ","ди":"ぢ","ду":"づ","дэ":"で","де":"で","до":"ど","дя":"ぢゃ","дю":"ぢゅ","дё":"ぢょ","ба":"ば","би":"び","бу":"ぶ","бэ":"べ","бе":"べ","бо":"ぼ","бя":"びゃ","бю":"びゅ","бё":"びょ","па":"ぱ","пи":"ぴ","пу":"ぷ","пэ":"ぺ","пе":"ぺ","по":"ぽ","пя":"ぴゃ","пю":"ぴゅ","пё":"ぴょ","ва":"わ","ви":"ゐ","вэ":"ゑ","ве":"ゑ","во":"を","-о":"を","--":"ー"]
    let kiriji_3 = ["дза":"ざ","дзи":"じ","дзу":"ず","дзэ":"ぜ","дзе":"ぜ","дзо":"ぞ","дзя":"じゃ","джа":"じゃ","дзю":"じゅ","джу":"じゅ","дзё":"じょ","джо":"じょ"]
    let romaji_1 = ["a":"あ","i":"い","u":"う","e":"え","o":"お","n":"ん","-":"",":":"ー","'":"","b":"っ","c":"っ","d":"っ","f":"っ","g":"っ","h":"っ","j":"っ","k":"っ","m":"っ","p":"っ","r":"っ","s":"っ","t":"っ","v":"っ","w":"っ","z":"っ"]
    let romaji_2 = ["ka":"か","ki":"き","ku":"く","ke":"け","ko":"こ","sa":"さ","si":"し","su":"す","se":"せ","so":"そ","ta":"た","ti":"ち","tu":"つ","te":"て","to":"と","na":"な","ni":"に","nu":"ぬ","ne":"ね","no":"の","ha":"は","hi":"ひ","fu":"ふ","hu":"ふ","he":"へ","ho":"ほ","ma":"ま","mi":"み","mu":"む","me":"め","mo":"も","ra":"ら","ri":"り","ru":"る","re":"れ","ro":"ろ","ga":"が","gi":"ぎ","gu":"ぐ","ge":"げ","go":"ご","za":"ざ","zi":"じ","ji":"じ","zu":"ず","ze":"ぜ","zo":"ぞ","ja":"じゃ","ju":"じゅ","jo":"じょ","da":"だ","di":"ぢ","du":"づ","de":"で","do":"ど","ba":"ば","bi":"び","bu":"ぶ","be":"べ","bo":"ぼ","pa":"ぱ","pi":"ぴ","pu":"ぷ","pe":"ぺ","po":"ぽ","ya":"や","yu":"ゆ","yo":"よ","wa":"わ","wi":"ゐ","we":"ゑ","wo":"を","-o":"を","--":"ー"]
    let romaji_3 = ["kya":"きゃ","kyu":"きゅ","kyo":"きょ","sha":"しゃ","sya":"しゃ","syu":"しゅ","shu":"しゅ","syo":"しょ","sho":"しょ","shi":"し","chi":"ち","tsu":"つ","tya":"ちゃ","cha":"ちゃ","tyu":"ちゅ","chu":"ちゅ","tyo":"ちょ","cho":"ちょ","nya":"にゃ","nyu":"にゅ","nyo":"にょ","hya":"ひゃ","hyu":"ひゅ","hyo":"ひょ","mya":"みゃ","myu":"みゅ","myo":"みょ","rya":"りゃ","ryu":"りゅ","ryo":"りょ","gya":"ぎゃ","gyu":"ぎゅ","gyo":"ぎょ","zya":"じゃ","zyu":"じゅ","zyo":"じょ","dya":"ぢゃ","dyu":"ぢゅ","dyo":"ぢょ","bya":"びゃ","byu":"びゅ","byo":"びょ","pya":"ぴゃ","pyu":"ぴゅ","pyo":"ぴょ"]
    
    if(language == "ru") {        
        for (key, value) in kiriji_3 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }
        
        for (key, value) in kiriji_2 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }
        
        for (key, value) in kiriji_1 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }        
    } else {        
        for (key, value) in romaji_3 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }
        
        for (key, value) in romaji_2 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }
        
        for (key, value) in romaji_1 {
            strok = strok.replacingOccurrences(of: key, with: value, options: .literal, range: nil)
        }
    }
    
    return strok    
}